// ********************** SU *******************************

// 快捷键

// 编辑-不选择， Ctrl 键 + Shift 键 + A
// 编辑-复制、移动， Ctrl 键 + D
// 编辑-复制， Ctrl 键 + C
// 编辑-粘贴， Ctrl 键 + V
// 编辑-还原， Ctrl 键 + Z ，新建的队列、删除的队列、操作队列
// 编辑-重复， Ctrl 键 + Y ，取消还原
// 编辑-剪切， Ctrl 键 + X ，剪切到其它图层的相同位置
// 编辑-取消组合， Ctrl 键 + Shift 键 + G
// 编辑-组合， Ctrl 键 + G

// 工具-尺寸-线性， D
// 工具-尺寸-矩形， R
// 工具-卷尺， T
// 工具-偏移， F
// 工具-推拉， P
// 工具-删除， E
// 工具-文本， T
// 工具-样式， B
// 工具-圆， C
// 工具-圆弧， A
// 工具-直线， L

// 视图-平移， H
// 视图-旋转， O
// 视图-缩放， Z ，合适大小， Shift + Z

// 模型-平移， M
// 模型-选择， Q
// 模型-缩放， S

// 取消操作， Esc
// 回到第一个模式， 空格

// =========================================================

// 点的形状和颜色，不缩放、比例大小

// 鼠标、辅助图标，铅笔、辅助形状

// =========================================================

// 选择 S ，平移、旋转、缩放

// ==========================================================

// 直线，直线和点、拖拽控制点（两个对称的控制点）、空格退到选择
// 手绘线，拖动画线，单击重绘

// 圆弧，半径和角度的两段线、两点和拉伸的点、三点
// 扇形，半径和角度的两段线

// 矩形，圆角、圆边、凸起

// 圆形、椭圆、多边形

// ===========================================================

// 偏移，点上、线上、中点、辅助线

// 推拉平面，

// 模型移动、拉伸、复制，移动命令、Ctrl/Shift/Alt

// 模型旋转、拉伸、扭曲、复制，旋转命令、Ctrl/Shift/Alt

// 模型缩放，包围盒、控制点、拖动缩放

// ===========================================================

// 相机的移动、旋转、缩放、缩放到合适比例

// ===========================================================

// 文本，拖动修改位置

// 标签，箭头、直线、线框、点的捕捉

// 尺寸，长度（实际距离、分量距离）、角度（正角、负角）

// 卷尺，测量距离、创建引导线

// 表格，

// 材质，设置材质和颜色、取材质 Alt

// ===========================================================

// 删除，点击删除、拖动多选删除

// 样式，选择样式、应用样式到其它对象

// 分割，选点分割线段

// 组合，

// ===========================================================

// 操作说明，

// 文本框，提示数据、输入数据控制

// ******************* end ***********************************


// ******************* 划线功能 **************************

// 划线功能快捷键

// 实线和虚线切换 alt+b

// 绘制圆弧曲线 ctrl+b

// 线段确定 空格

// 修改线的点位 shift+拖动

// 删除选择的线、画的线 delete

// 退出输入框 esc

// 显示输入框 enter

// 撤销一个点 ctrl+z

// 删除线 shift+alt+单击

// 隐藏或显示点模型 shift+空格

// 保存线段回调 ctrl+q

// 显示线段信息 shift+a

// 划线生成体块 shift+z

// 取消吸附效果 ctrl

// ******************** end ******************************